In [1]:
import pandas as pd
import numpy as np

In [2]:
# import sys
# sys.path.append('.../Jane')

import extract_data_ez
import transformers_ez

%load_ext autoreload
%autoreload 2

Your data is ready! Merged table name is zillow_full.

In [3]:
date_cut = '2015-01-01'

In [4]:
df_initial = extract_data_ez.zillow_data
air_df_initial = extract_data_ez.airqual_data
persinc_df_initial = extract_data_ez.persinc_data
inclvl_df_initial = extract_data_ez.inclvl_data
census_df_initial = extract_data_ez.census_data

zillow_full_initial = extract_data_ez.zillow_full

In [5]:
zillow_full_initial['AQIMean']

0        21.963579
1        21.963579
2        21.963579
3        21.963579
4        22.977550
           ...
17746    20.694839
17747    20.694839
17748    20.694839
17749    20.554632
17750    20.554632
Name: AQIMean, Length: 17751, dtype: float64

In [6]:
df = df_initial.copy()
air_df = air_df_initial.copy()
persinc_df = persinc_df_initial.copy()
inclvl_df = inclvl_df_initial.copy()
census_df = census_df_initial.copy()
nulls_df = df[df['Rent'].isnull()]

In [7]:
nulls_df

Empty DataFrame
Columns: [Zipcode, City, State, Metro, County, SizeRank, Date, Rent, Year, State-County]
Index: []

In [8]:
df = df_initial.copy()
include_cities = ['Miami Beach','Miami','North Miami']
#df = df[df['City'].isin(include_cities)]
counties = ['Miami-Dade County', 'Broward County', 'Palm Beach County']
# counties = ['Alameda County', 'Contra Costa County', 'Marin County', 'Napa County', 'San Mateo County', 
#             'Santa Clara County', 'Solano County', 'Sonoma County', 'San Francisco County']
df = df[df['County'].isin(counties)]

In [9]:
df.head()

,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year,State-County
96843,33160,Sunny Isles Beach,FL,Miami-Fort Lauderdale-West Palm Beach,Miami-Dade County,72,2015-01-01,1963.0,2015,FL-Miami-Dade County
96857,33025,Miramar,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,86,2015-01-01,1393.0,2015,FL-Broward County
96862,33139,Miami Beach,FL,Miami-Fort Lauderdale-West Palm Beach,Miami-Dade County,91,2015-01-01,2009.0,2015,FL-Miami-Dade County
96899,33024,Pembroke Pines,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,128,2015-01-01,1295.0,2015,FL-Broward County
96932,33009,Hallandale,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,161,2015-01-01,1524.0,2015,FL-Broward County

In [10]:
air_df.head()

        Date State                County    AQIMean
0 2010-01-01    CA        Alameda County  16.186197
1 2010-01-01    CA   Contra Costa County   9.828137
2 2010-01-01    CA          Marin County  15.767698
3 2010-01-01    CA           Napa County  11.892719
4 2010-01-01    CA  San Francisco County  19.534288

In [11]:
air_df['County'].unique()

array(['Alameda County', 'Contra Costa County', 'Marin County',
       'Napa County', 'San Francisco County', 'San Mateo County',
       'Santa Clara County', 'Solano County', 'Sonoma County',
       'Broward County', 'Miami-Dade County', 'Palm Beach County',
       'Bronx County', 'Kings County', 'New York County', 'Queens County',
       'Richmond County', 'Travis County'], dtype=object)

In [12]:
df['County'].unique()

array(['Miami-Dade County', 'Broward County', 'Palm Beach County'],
      dtype=object)

In [13]:
air_df = air_df[air_df['County'].isin(counties)]
print(air_df['AQIMean'].min())
print(air_df['AQIMean'].max())

1.421812677419355
13.83628184204672

In [13]:
#air_df
min_df = air_df[['AQIMean','County','Date']].groupby(['County','Date']).min().reset_index()
min_df = min_df.rename(columns={'AQIMean':'min'})
max_df = air_df[['AQIMean','County','Date']].groupby(['County','Date']).max().reset_index()
max_df = max_df.rename(columns={'AQIMean':'max'})
grouped = pd.merge(min_df,max_df,on=['County','Date'],how='inner')

In [14]:
grouped.to_csv('min_max_comp.csv')

In [15]:
df['State'].unique()

array(['FL'], dtype=object)

In [16]:
persinc_df.head()

  State  Year  PersonalIncome
0    TX  2008           44521
1    FL  2008           44447
2    NY  2008           48585
3    CA  2008           54862
4    TX  2009           42103

In [17]:
census_df.head()

,do_date,total_pop,households,median_age,median_income,income_per_capita,gini_index,Zipcode,pct_poverty,housing_availability,home_density,pct_employed,pct_jobs_nightlife,pct_unemployed,move_within_city,move_new_city,avg_commute_time,pct_college
0,2014-01-01,2510,856,42.1,NaN,NaN,NaN,87537,NaN,1.685748,2.932243,NaN,NaN,NaN,NaN,NaN,NaN,0.066932
1,2014-01-01,346,112,50.9,NaN,NaN,NaN,87017,NaN,2.142857,3.089286,NaN,NaN,NaN,NaN,NaN,NaN,0.057803
2,2014-01-01,3505,727,27.9,NaN,NaN,NaN,87528,NaN,1.408528,4.821183,NaN,NaN,NaN,NaN,NaN,NaN,0.032810
3,2014-01-01,133,58,25.8,NaN,NaN,NaN,87533,NaN,1.172414,2.293103,NaN,NaN,NaN,NaN,NaN,NaN,0.067669
4,2014-01-01,2896,787,36.0,NaN,NaN,NaN,87511,NaN,1.645489,3.679797,NaN,NaN,NaN,NaN,NaN,NaN,0.038674

In [18]:
    #inclvl_moderate = dataframe[dataframe.IncomeLevelGroup == 'Moderate'][['Date','Vol']]
    #inclvl_moderate = inclvl_moderate.rename(columns={'Vol':'Vol_moderate_income'})
    #inclvl_low = dataframe[dataframe.IncomeLevelGroup == 'Low'][['Date','Vol']]
    #inclvl_low = inclvl_low.rename(columns={'Vol':'Vol_low_income'})
    #dataframe = pd.merge(inclvl_moderate,inclvl_low,on='Date')

In [19]:
merged_df = transformers_ez.join_dfs(df,air_df,persinc_df,inclvl_df,census_df)

In [20]:
len(merged_df)

3660

In [21]:
len(df)

3660

In [22]:
for i in merged_df.columns:
    if 'ean' in i:
        print(i)

AQIMean

In [23]:
merged_df['AQIMean']

0        8.599690
1        6.869881
2        8.599690
3        6.869881
4        6.869881
          ...
3655     8.321691
3656     8.321691
3657     8.321691
3658    10.780634
3659          NaN
Name: AQIMean, Length: 3660, dtype: float64